---
type: TaskDialog
namespace: Autodesk.Revit.UI
version: 2024
members: 21
tags: [revit-api, class]
---

# TaskDialog

`Autodesk.Revit.UI.TaskDialog` · Revit 2024 · 21 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TaskDialog | 2011 | `public TaskDialog ( string title )` |
| Method | AddCommandLink | — | `` |
| Method | EnableDoNotShowAgain | 2020 | `public void EnableDoNotShowAgain ( string dialogId , bool enableDoNotShow , string doNotShowText )` |
| Method | Show | — | `` |
| Method | Show | 2011 | `public TaskDialogResult Show ()` |
| Method | WasExtraCheckBoxChecked | 2017 | `public bool WasExtraCheckBoxChecked ()` |
| Method | WasVerificationChecked | 2011 | `public bool WasVerificationChecked ()` |
| Property | AllowCancellation | 2011 | `public bool AllowCancellation { get ; set ; }` |
| Property | CommonButtons | 2011 | `public TaskDialogCommonButtons CommonButtons { get ; set ; }` |
| Property | DefaultButton | 2011 | `public TaskDialogResult DefaultButton { get ; set ; }` |
| Property | EnableMarqueeProgressBar | 2020 | `public bool EnableMarqueeProgressBar { get ; set ; }` |
| Property | ExpandedContent | 2011 | `public string ExpandedContent { get ; set ; }` |
| Property | ExtraCheckBoxText | 2017 | `public string ExtraCheckBoxText { get ; set ; }` |
| Property | FooterText | 2011 | `public string FooterText { get ; set ; }` |
| Property | Id | 2011 | `public string Id { get ; set ; }` |
| Property | MainContent | 2011 | `public string MainContent { get ; set ; }` |
| Property | MainIcon | 2011 | `public TaskDialogIcon MainIcon { get ; set ; }` |
| Property | MainInstruction | 2011 | `public string MainInstruction { get ; set ; }` |
| Property | Title | 2011 | `public string Title { get ; set ; }` |
| Property | TitleAutoPrefix | 2011 | `public bool TitleAutoPrefix { get ; set ; }` |
| Property | VerificationText | 2011 | `public string VerificationText { get ; set ; }` |